Revit 2018 API
BuiltInFailures.MEPCalculationFailures Properties
The BuiltInFailures.MEPCalculationFailures type exposes the following members.
Properties
Name | Description
ClassificationNotSetInFamily
 A calculation did not complete because the Classification parameter in the Mechanical Equipment family is not set.
DemandFlowAndPressureLossNotSetInLossFamily
 A calculation did not complete because the pressure loss value for element is not set. Select the element and enter a value for the Pressure Loss.
DemandFlowNotSetInLossFamily
 A calculation did not complete because the Demand Flow for the element is not set.
DuctFittingAndAccessoryPressureDropCalculatorNotAvailable
 Duct Fitting/Accessory Pressure Drop Calculator Not Available: [Calculator Name]
DuctPressureDropCalculatorNotAvailable
 Duct Pressure Drop Calculator Not Available: [Calculator Name]
FlowAndPressureCalculationMethodHasBeenImproved
 During upgrade pressure drop calculations for hydronic piping systems using Simplified Colebrook or Custom Calculation methods have been recalculated using the Colebrook equation.
Network_ElementNodeIsNotPartOfNetwork
 The calculation could not be executed as configured. At least one of the elements in this network uses a node that is not part of the network.
Network_NodePropertyNotSet
 The calculation could not be executed as configured. Specify a constraint property set for the following input or output node(s).
Network_NoInputNode
 The calculation could not be executed as configured. Select an input node before analyzing this network.
Network_NoOutputNode
 The calculation could not be executed as configured. Select an output node before analyzing this network.
Network_NoPressureConstraint
 The calculation could not be executed as configured. Each network requires at least 1 pressure constraint. Specify the pressure constraint.
Network_NotEnoughElements
 The calculation could not be executed as configured. Specify at least 3 elements before analyzing this network.
Network_NotEnoughNodes
 The calculation could not be executed as configured. Specify at least 4 elements before analyzing this network.
Network_NotFullyConnected
 The calculation could not be executed as configured. The network is not continuous. Check for disconnects before analyzing this network.
Network_OverConstrained
 The calculation could not be executed as configured. The Pressure and Flow Rate combined constraint requires at least 2 other pressure or flow constraints. Specify additional constraints.
NetworkCanNotDeterminCriticalPath
 The calculation has completed, but there may be an error in determining the critical path. Verify that demand flow is specified for all required elements.
NetworkDefaultToPressure
 The network uses the default pressure.
NetworkDefaultToReynolds
 The network uses the default Reynolds number.
NetworkEnergyEquationNotConverge
 The energy calculation could not be performed.
NetworkErrorCalculatingPressure
 The pressure calculation could not be performed.
NetworkErrorElementWithDownUpStreamNode
 The network needs an input or output element to perform the calculation.
NetworkErrorExtractCurveData
 The calculation could not be performed. Verify the pump curve data.
NetworkErrorModelTooBig
 The size of the network exceeds the current limit for flow/pressure analysis. In the Mechanical Settings dialog, under Pipe Settings - Calculation, disable the option to Use analysis for closed loop hydronic networks.
NetworkErrorOverConstrained
 The calculation could not be performed. Verify that demand flow is specified for all required elements.
NetworkInconsistentDemandFlow
 The specified flow on this equipment is inconsistent with the other equipment in this branch. The branch flow is calculated based on the maximum specified value.
NetworkMinorLossNotConverge
 The minor loss calculation could not be performed.
NetworkPressureNotConverge
 The calculation could not be performed. Verify the pressure on the input element.
PipeConnectorsAreNotLined
 A calculation did not complete because the connectors used by this family to connect to the network are not linked.
PipeFittingAndAccessoryPressureDropCalculatorNotAvailable
 Pipe Fitting/Accessory Pressure Drop Calculator Not Available: [Calculator Name]
PipePressureDropCalculatorNotAvailable
 Pipe Pressure Drop Calculator Not Available: [Calculator Name]
PlumbingFlowCalculatorNotAvailable
 Plumbing Flow Calculator Not Available: [Calculator Name]
PressureLossNotSetInLossFamily
 A calculation did not complete because the pressure loss value for the source equipment is not set for the network.
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace